Revit 2027 API
DimensionType.SetAlternateUnitsFormatOptions Method
 Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAlternateUnitsFormatOptions(
	FormatOptions formatOptions
)
Public Sub SetAlternateUnitsFormatOptions (
	formatOptions As FormatOptions
)
public:
void SetAlternateUnitsFormatOptions(
	FormatOptions^ formatOptions
)
member SetAlternateUnitsFormatOptions :
        formatOptions : FormatOptions -> unit
Parameters
formatOptions FormatOptions
 The FormatOptions.
Exceptions
Exception | Condition
ArgumentException |  The display unit in formatOptions is not a valid display unit for the unit type of this DimensionType, or the rounding method in formatOptions is not set to Nearest. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
ArgumentNullException |  A non-optional argument was null
Remarks
 See the UnitType property to determine the unit type of this dimension style.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace